# specify a directory to install
cask_args appdir: '/Applications'

# manages background services
tap 'homebrew/services'

tap 'homebrew/cask-fonts'
cask 'font-meslo-lg-nerd-font'

#tap 'mongodb/brew'
#brew 'mongodb-community@6.0'

# brew 'apktool'
# brew 'cocoapods'
# brew 'diff-so-fancy'
brew 'dive'
brew 'figlet'
# brew 'go'
brew 'htop'
brew 'jq'
brew 'lolcat'
brew 'minikube'
# brew 'postgresql'
# brew 'redis'
# brew 'scrcpy'
# brew 'terraform'
brew 'thefuck'
brew 'tldr'
brew 'tree'
#brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

tap 'homebrew/cask'
cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'dash'
cask 'dbeaver-community'
cask 'docker'
# cask 'figma'
# cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
# cask 'intellij-idea'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'keepingyouawake'
cask 'mockoon'
cask 'ngrok'
cask 'openemu'
cask 'postman'
#cask 'quicklook-json'
cask 'rectangle'
# cask 'rubymine'
# cask 'sequel-ace'
cask 'skype'
cask 'slack'
# cask 'sococo'
# cask 'spotify'
# cask 'teamviewer'
# cask 'tuple'
# cask 'transmission'
cask 'transnomino'
cask 'visual-studio-code'
cask 'vlc'
# cask 'zeplin'
# cask 'zoom'
