# specify a directory to install
cask_args appdir: '/Applications'

# manages background services
tap 'homebrew/services'

tap 'homebrew/cask-fonts'

brew 'subversion'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-meslo-lg-nerd-font'

tap 'adoptopenjdk/openjdk'
cask 'adoptopenjdk8'
cask 'adoptopenjdk11'

tap 'mongodb/brew'
brew 'mongodb-community@5.0'

# brew 'apktool'
# brew 'cocoapods'
brew 'cowsay'
# brew 'diff-so-fancy'
brew 'dive'
brew 'dockutil'
brew 'figlet'
# brew 'go'
brew 'htop'
brew 'jq'
brew 'lolcat'
# brew 'postgresql'
brew 'rbenv'
# brew 'redis'
# brew 'scrcpy'
# brew 'terraform'
brew 'thefuck'
brew 'tldr'
brew 'tree'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

tap 'homebrew/cask'
cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'dash'
cask 'dbeaver-community'
cask 'docker'
# cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
# cask 'intellij-idea'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'mockoon'
cask 'ngrok'
cask 'postman'
cask 'quicklook-json'
cask 'rubymine'
cask 'skype'
cask 'slack'
cask 'sococo'
# cask 'spotify'
cask 'teamviewer'
# cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'zeplin'
cask 'zoom'
